---
kind: method
id: M:Autodesk.Revit.DB.AssemblyInstance.GetCenter
source: html/fa4de5ef-39ef-b51e-8625-b33970326324.htm
---
# Autodesk.Revit.DB.AssemblyInstance.GetCenter Method

Returns the center of the bounding box for the assembly instance.
 This is the default position for placed assembly instances.

## Syntax (C#)
```csharp
public XYZ GetCenter()
```

## Returns
The position for the center of the assembly instance.